# 2014 - 2017 Shooting Data Analysis

Data Source: http://www.gunviolencearchive.org/

In [85]:
import pandas as pd

In [86]:
df14 = pd.read_csv("RawData/2014.csv")
df15 = pd.read_csv("RawData/2015.csv")
df16 = pd.read_csv("RawData/2016.csv")
df17 = pd.read_csv("RawData/2017.csv")
df14.head()

,Incident Date,State,City Or County,Address,# Killed,# Injured,Operations
0,12/31/14,California,Los Angeles,81st Street and Western Avenue,1,3,NaN
1,12/29/14,Louisiana,New Orleans,Poydras and Bolivar,0,4,NaN
2,12/27/14,California,Los Angeles,8800 block of South Figueroa Street,1,3,NaN
3,12/27/14,California,Sacramento,4000 block of May Street,0,4,NaN
4,12/26/14,Illinois,East St. Louis,2500 block of Summit Avenue,1,3,NaN

In [87]:
frames = [df14, df15, df16, df17]
frames

[    Incident Date           State   City Or County  \
 0        12/31/14      California      Los Angeles
 1        12/29/14       Louisiana      New Orleans
 2        12/27/14      California      Los Angeles
 3        12/27/14      California       Sacramento
 4        12/26/14        Illinois   East St. Louis
 5        12/24/14        Missouri      Saint Louis
 6        12/23/14        Kentucky       Winchester
 7        12/22/14        Michigan          Detroit
 8        12/22/14        New York          Webster
 9        12/22/14        Illinois          Chicago
 10       12/21/14         Florida         Sarasota
 11       12/21/14     Mississippi       Waynesboro
 12       12/21/14        Illinois     Calumet City
 13       12/20/14        Illinois         Rockford
 14       12/16/14      New Jersey        Elizabeth
 15       12/15/14    Pennsylvania         Lansdale
 16       12/14/14         Florida            Miami
 17       12/13/14         Florida            Tampa
 18       12/12/14          Oregon         Portland
 19        12/7/14         Indiana       South Bend
 20        12/2/14        Missouri      Saint Louis
 21        12/2/14        Virginia     Newport News
 22       11/30/14        New York         Brooklyn
 23       11/30/14       Tennessee      Chattanooga
 24       11/29/14         Georgia          Atlanta
 25       11/29/14      New Jersey           Newark
 26       11/28/14       Tennessee          Memphis
 27       11/27/14           Texas       Georgetown
 28       11/26/14      California    San Francisco
 29       11/23/14        Virginia  Accomack County
 ..            ...             ...              ...
 243       2/20/14      California          Alturas
 244       2/20/14         Indiana     Indianapolis
 245       2/16/14           Texas       Fort Worth
 246       2/16/14         Florida    Orange County
 247       2/16/14         Florida     Jacksonville
 248       2/16/14           Texas           Dallas
 249       2/16/14         Indiana       Fort Wayne
 250       2/15/14          Nevada        Las Vegas
 251       2/12/14         Indiana             Gary
 252       2/12/14      California          Oakland
 253       2/12/14      California         Stockton
 254        2/7/14         Florida            Miami
 255        2/6/14       Louisiana      New Orleans
 256        2/5/14        Illinois          Chicago
 257        2/3/14         Indiana         Franklin
 258       1/27/14  North Carolina      Rocky Mount
 259       1/27/14      Washington          Seattle
 260       1/25/14        Illinois          Chicago
 261       1/25/14         Florida      Belle Glade
 262       1/21/14      New Jersey           Newark
 263       1/20/14        Virginia         Manassas
 264       1/16/14            Utah     Spanish Fork
 265       1/16/14        Oklahoma          Ardmore
 266       1/14/14      California      Los Angeles
 267       1/13/14        Michigan          Detroit
 268       1/12/14       Louisiana         Tallulah
 269       1/12/14         Alabama       Huntsville
 270       1/12/14        Illinois            Elgin
 271        1/3/14        New York           Queens
 272        1/1/14        Virginia          Norfolk

                                            Address  # Killed  # Injured  \
 0                   81st Street and Western Avenue         1          3
 1                              Poydras and Bolivar         0          4
 2              8800 block of South Figueroa Street         1          3
 3                         4000 block of May Street         0          4
 4                      2500 block of Summit Avenue         1          3
 5                                    18th and Pine         1          3
 6                                 260 Oxford Drive         1          3
 7                            Charlevoix and Philip         1          3
 8                                    191 Lake Road         4          2
 9                 5700 block of South Green Street         0          5
 10                          4034 N Washington Blvd         2          2
 11                                  Central Avenue         1          4
 12                            600 block of Escanba         1          8
 13                   3200 block of Montrose Avenue         4          0
 14                                     Anna Street         0          4
 15                        100 block of West 5th St         7          0
 16                       1311 Northwest 2nd Avenue         1          4
 17                             810 E. Skagway Ave.         0          5
 18                   717 North Killingsworth Court         0          4
 19                   16000 block of Roosevelt Road         0          4
 20                   6000 block of Virginia Avenue         1          5
 21                             6128 Jefferson Ave          0          5
 22                               375 Remsen Avenue         0          4
 23                          2412 East 13th Street          0          5
 24                   1600 block of Richmond Avenue         3          2
 25                                348 S Orange Ave         1          3
 26                          1849 East Brooks Road          0          4
 27                                      Pvt Rd 934         2          3
 28                        Mission and 13th streets         0          6
 29                                   Parksley Road         0          4
 ..                                             ...       ...        ...
 243                                   300 W 1st St         4          2
 244                     3400 block of South Parker         4          0
 245                                115 NW 25th St.         1          4
 246                  4500 block of Riviera Shores          1          6
 247                          1187 S. Edgewood Ave.         1          4
 248             2600 block of South Harwood Street         1          7
 249         Lafayette Street and East Tillman Road         0          5
 250                           Sahara and Maryland          0          5
 251                         2220 block of Broadway         0          5
 252                        37th and International          1          3
 253                              Constitution Park         1          3
 254          Northwest 41st Street and 9th Avenue          0          5
 255                     4600 block of Downman Road         0          4
 256                                6740 N Clark St         1          3
 257                    2100 block of Bridlewood Dr         3          2
 258                                 821 Word Plaza         0          4
 259         2nd Avenue South and South Main Street         1          4
 260                     S. Union Av and W. 51st St         1          4
 261                    600 block of Covenant Drive         0          4
 262                            Springfield Avenue          2          3
 263                                 8509 Rixlew Ln         0          4
 264                                 37 N. 630 West         5          0
 265                                            NaN         2          4
 266                               West 86th Street         0          4
 267                        800 block of Calvert St         0          4
 268                     3600 block of Highway 80 W         0          6
 269                               University Drive         0          5
 270                      300 block of North Street         0          5
 271             Farmers Boulevard and 133rd Avenue         1          3
 272  Rockingham Street and Berkley Avenue Extended         2          2

      Operations
 0           NaN
 1           NaN
 2           NaN
 3           NaN
 4           NaN
 5           NaN
 6           NaN
 7           NaN
 8           NaN
 9           NaN
 10          NaN
 11          NaN
 12          NaN
 13          NaN
 14          NaN
 15          NaN
 16          NaN
 17          NaN
 18          NaN
 19          NaN
 20          NaN
 21          NaN
 22          NaN
 23          NaN
 24          NaN
 25          NaN
 26          NaN
 27          NaN
 28          NaN
 29          NaN
 ..          ...
 243         NaN
 244         NaN
 245         NaN
 246         NaN
 247         NaN
 248         NaN
 249         NaN
 250         NaN
 251         NaN
 252         NaN
 253         NaN
 254         NaN
 255         NaN
 256         NaN
 257         NaN
 258         NaN
 259         NaN
 260         NaN
 261         NaN
 262         NaN
 263         NaN
 264         NaN
 265         NaN
 266         NaN
 267         NaN
 268         NaN
 269         NaN
 270         NaN
 271         NaN
 272         NaN

 [273 rows x 7 columns],
     Incident Date           State                    City Or County  \
 0        12/31/15       Louisiana                       New Orleans
 1        12/27/15       Tennessee                           Jackson
 2        12/26/15    Pennsylvania                      Philadelphia
 3        12/25/15         Florida                      Jacksonville
 4        12/25/15         Alabama                            Mobile
 5        12/21/15      California                       San Leandro
 6        12/20/15  North Carolina                        Wilmington
 7        12/20/15         Florida                    Miami (Goulds)
 8        12/20/15         Florida               Miami-dade (county)
 9        12/13/15      California                       Los Angeles
 10       12/13/15      California                  Huntington Beach
 11       12/12/15         Georgia                          Savannah
 12       12/12/15        Illinois                Lovejoy (Brooklyn)
 13       12/11/15        Maryland                         Baltimore
 14       12/11/15    Pennsylvania         Pittsburgh (Mount Oliver)
 15        12/8/15            Ohio            Cincinnati (Fairmount)
 16        12/6/15       Louisiana                          Raceland
 17        12/6/15        Nebraska                             Omaha
 18        12/2/15      California                    San Bernardino
 19        12/2/15         Georgia                          Savannah
 20       11/29/15        Illinois                          Kankakee
 21       11/27/15        Colorado                  Colorado Springs
 22       11/27/15      California                        Sacramento
 23       11/24/15  South Carolina                    Horry (county)
 24       11/23/15            Ohio                          Columbus
 25       11/23/15       Minnesota                       Minneapolis
 26       11/22/15           Texas                       Brownsville
 27       11/22/15      Washington                           Seattle
 28       11/22/15        New York                          Newburgh
 29       11/22/15  South Carolina                  North Charleston
 ..            ...             ...                               ...
 303       2/15/15      California                        Long Beach
 304        2/9/15         Florida                   New Port Richey
 305        2/8/15       Tennessee                        Friendship
 306        2/7/15         Georgia                      Douglasville
 307        2/6/15        Oklahoma                             Tulsa
 308        2/5/15            Ohio  Beachwood (Warrensville Heights)
 309        2/1/15        New York                          Syracuse
 310        2/1/15        New York              New York (Manhattan)
 311       1/31/15         Georgia                          Lagrange
 312       1/28/15         Georgia                     Dekalb County
 313       1/26/15      California                          Stockton
 314       1/24/15        New York                  Arverne (Queens)
 315       1/24/15        Nebraska                             Omaha
 316       1/23/15   Massachusetts                            Boston
 317       1/20/15       Tennessee                       Clarksville
 318       1/19/15           Texas                       San Antonio
 319       1/13/15        Illinois                          Rockford
 320       1/13/15        Virginia                        Portsmouth
 321       1/11/15  North Carolina                        Hope Mills
 322       1/11/15         Florida                          Lakeland
 323       1/11/15      California                          San Jose
 324       1/10/15          Kansas                           Wichita
 325        1/9/15      California                     San Francisco
 326        1/8/15   Massachusetts                            Boston
 327        1/7/15       Tennessee                       Chattanooga
 328        1/6/15         Florida                             Miami
 329        1/4/15        Virginia                           Roanoke
 330        1/4/15           Texas                            Dallas
 331        1/2/15         Georgia                          Savannah
 332        1/1/15       Tennessee                           Memphis

                                                Address  # Killed  # Injured  \
 0                          1900 block of Amelia Street         0          6
 1                                        North Parkway         0          4
 2                                   4210 Macalester St         0          4
 3                                  Franklin and Odessa         0          4
 4                                 785 Schillinger Rd S         0          4
 5                      14600 block of East 14th Street         0          4
 6                               11th and Castle Street         1          4
 7                         21630 Southwest 120th Avenue         1          4
 8    Northeast Seventh Avenue and Northeast 166th S...         0          4
 9                                5550 S. Flower Street         1          3
 10                         17000 block of Keelson Lane         0          4
 11                                     Whitaker Street         0          4
 12                                    307 Jefferson St         1          3
 13                   5100 block of Park Heights Avenue         1          3
 14                      200 block of  Brownsville Road         0          4
 15                      2300 block of Baltimore Avenue         1          3
 16                                       Market Street         1          3
 17                North 108th Street and Military Road         2          3
 18                          1365 South Waterman Avenue        16         19
 19                       100 block of West 33rd Street         1          3
 20                                     648 E. Court St         0          5
 21                                3480 Centennial Blvd         3          9
 22                           7900 block of Florin Road         2          2
 23                                 1321 Colletta Court         0          4
 24                       90 block of S. Terrace Avenue         4          1
 25                                 Morgan Avenue North         0          5
 26                                1800 block of FM 802         0          4
 27                                   Broadway and Pike         0          4
 28                                        203 Broadway         0          5
 29                                         Park Circle         1          3
 ..                                                 ...       ...        ...
 303                        200 block of W. 14th Street         0          5
 304                                  9552 Adler Street         3          1
 305                                      251 Dupree Rd         0          6
 306                            3640 Willow Tree Circle         5          2
 307                              1219 N. Sheridan Road         1          4
 308                                       Harvard Road         3          3
 309                           1217 West Fayette Street         0          6
 310                                      3345 Broadway         1          4
 311                      100 block of Woodstream Trail         4          0
 312                          1600 block of Panola Road         1          3
 313                        1500 block of E. 9th Street         1          3
 314                                231-11 148th Avenue         4          1
 315                                     3402 Parker St         3          5
 316                                  954 Parker Street         0          6
 317                                 321 Lansinger Lane         1          3
 318                            1000 block of Gibbs St.         2          5
 319                         700 block of Oakley Avenue         2          2
 320                 4100 block of Portsmouth Boulevard         0          5
 321                        1900 block of Gumberry Road         2          5
 322                                    7665 Chase Road         1          3
 323                                  3840 Monterey Hwy         0          5
 324                                4859 E Harry Street         2          2
 325                            Laguna and Page streets         4          0
 326                               104 Harrishof Street         1          3
 327                               773 West Main Street         1          3
 328                       1300 block of NW 62nd Street         1          3
 329                             3634 Shenandoah Ave NW         2          4
 330                          2000 block of Ben Hur St.         3          1
 331                        500 block of W. 54th Street         1          4
 332                   Interstate 240 and Poplar Avenue         0          5

      Operations
 0           NaN
 1           NaN
 2           NaN
 3           NaN
 4           NaN
 5           NaN
 6           NaN
 7           NaN
 8           NaN
 9           NaN
 10          NaN
 11          NaN
 12          NaN
 13          NaN
 14          NaN
 15          NaN
 16          NaN
 17          NaN
 18          NaN
 19          NaN
 20          NaN
 21          NaN
 22          NaN
 23          NaN
 24          NaN
 25          NaN
 26          NaN
 27          NaN
 28          NaN
 29          NaN
 ..          ...
 303         NaN
 304         NaN
 305         NaN
 306         NaN
 307         NaN
 308         NaN
 309         NaN
 310         NaN
 311         NaN
 312         NaN
 313         NaN
 314         NaN
 315         NaN
 316         NaN
 317         NaN
 318         NaN
 319         NaN
 320         NaN
 321         NaN
 322         NaN
 323         NaN
 324         NaN
 325         NaN
 326         NaN
 327         NaN
 328         NaN
 329         NaN
 330         NaN
 331         NaN
 332         NaN

 [333 rows x 7 columns],
     Incident Date                 State                     City Or County  \
 0        12/31/16               Georgia                  Lenox (El Dorado)
 1        12/31/16                 Texas                            Houston
 2        12/30/16                  Ohio                          Mansfield
 3        12/30/16           Connecticut                        Wallingford
 4        12/28/16               Georgia                           Columbus
 5        12/25/16               Alabama                              Ozark
 6        12/25/16              Illinois                            Chicago
 7        12/25/16              New York                       Mount Vernon
 8        12/24/16        North Carolina                            Madison
 9        12/24/16        North Carolina                             Wilson
 10       12/23/16               Alabama                         Birmingham
 11       12/23/16              Illinois                            Chicago

In [88]:
df = pd.concat(frames).fillna(0)
df.head()

,Incident Date,State,City Or County,Address,# Killed,# Injured,Operations
0,12/31/14,California,Los Angeles,81st Street and Western Avenue,1,3,0.0
1,12/29/14,Louisiana,New Orleans,Poydras and Bolivar,0,4,0.0
2,12/27/14,California,Los Angeles,8800 block of South Figueroa Street,1,3,0.0
3,12/27/14,California,Sacramento,4000 block of May Street,0,4,0.0
4,12/26/14,Illinois,East St. Louis,2500 block of Summit Avenue,1,3,0.0

In [89]:
df['Date'] = pd.to_datetime(df['Incident Date'], format="%m/%d/%y")
df.head()

,Incident Date,State,City Or County,Address,# Killed,# Injured,Operations,Date
0,12/31/14,California,Los Angeles,81st Street and Western Avenue,1,3,0.0,2014-12-31
1,12/29/14,Louisiana,New Orleans,Poydras and Bolivar,0,4,0.0,2014-12-29
2,12/27/14,California,Los Angeles,8800 block of South Figueroa Street,1,3,0.0,2014-12-27
3,12/27/14,California,Sacramento,4000 block of May Street,0,4,0.0,2014-12-27
4,12/26/14,Illinois,East St. Louis,2500 block of Summit Avenue,1,3,0.0,2014-12-26

In [90]:
df2 = df['Date'].value_counts()
df2.head()

2017-04-15    6
2017-04-29    6
2016-07-04    6
2014-07-05    6
2016-09-11    6
Name: Date, dtype: int64

In [91]:
df2.to_csv('14-17Data.csv')

# Read in the new data file again

In [92]:
dff = pd.read_csv("14-17Data.csv", names = ['Dates', 'Counts'])
dff.head()

        Dates  Counts
0  2017-04-15       6
1  2017-04-29       6
2  2016-07-04       6
3  2014-07-05       6
4  2016-09-11       6

In [93]:
dff['Date'] = pd.to_datetime(dff['Dates'], format="%Y-%m-%d")
dff.head()

        Dates  Counts       Date
0  2017-04-15       6 2017-04-15
1  2017-04-29       6 2017-04-29
2  2016-07-04       6 2016-07-04
3  2014-07-05       6 2014-07-05
4  2016-09-11       6 2016-09-11

In [94]:
dfDate= pd.read_csv("RawData/14-17Date.csv")
dfDate.head()

    Dates
0  1/1/14
1  1/2/14
2  1/3/14
3  1/4/14
4  1/5/14

In [95]:
dfDate['Date'] = pd.to_datetime(dfDate['Dates'], format="%m/%d/%y")
dfDate.head()

    Dates       Date
0  1/1/14 2014-01-01
1  1/2/14 2014-01-02
2  1/3/14 2014-01-03
3  1/4/14 2014-01-04
4  1/5/14 2014-01-05

In [96]:
dff.dtypes

Dates             object
Counts             int64
Date      datetime64[ns]
dtype: object

In [97]:
dfDate.dtypes

Dates            object
Date     datetime64[ns]
dtype: object

In [98]:
dfFinal = pd.merge(dfDate, dff, on='Date', how='outer')
dfFinal.head()

  Dates_x       Date     Dates_y  Counts
0  1/1/14 2014-01-01  2014-01-01     1.0
1  1/2/14 2014-01-02         NaN     NaN
2  1/3/14 2014-01-03  2014-01-03     1.0
3  1/4/14 2014-01-04         NaN     NaN
4  1/5/14 2014-01-05         NaN     NaN

In [99]:
dfFinal = dfFinal.fillna(0)
dfFinal.head()

  Dates_x       Date     Dates_y  Counts
0  1/1/14 2014-01-01  2014-01-01     1.0
1  1/2/14 2014-01-02           0     0.0
2  1/3/14 2014-01-03  2014-01-03     1.0
3  1/4/14 2014-01-04           0     0.0
4  1/5/14 2014-01-05           0     0.0

In [100]:
dfFinal.to_csv('14-17finalData.csv')